/* 
Овал это начало или конец нашего агоритма
символ, который отделяет все 
один вход и один выход

паралеограмм позволяет нам определять
операции ввода и ввыводы данных, блоки
один вход и один выход

прямоугольник - это действие , любая операция, которая мы выполняем 
внутри нашего алгоритма
математические вычесления
один вход и один выход

ромб это наше условие , это как if 
один вход и два выхода

входы и выходы нужны для стрелок и к переходам
yes and no

подпрогграмма прямоугольник и внутри ещё прямоугольник
для других алгоритмов
, пример с функциями js


*/